-- MySQL dump 10.13  Distrib 5.6.23, for Win64 (x86_64)
--
-- Host: ec2-52-38-25-32.us-west-2.compute.amazonaws.com    Database: project
-- ------------------------------------------------------
-- Server version	5.7.17-0ubuntu0.16.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `genre`
--

DROP TABLE IF EXISTS `genre`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `genre` (
  `movie_id` int(11) NOT NULL,
  `genre` varchar(20) NOT NULL,
  PRIMARY KEY (`movie_id`,`genre`),
  CONSTRAINT `fk_genre` FOREIGN KEY (`movie_id`) REFERENCES `movie_inf` (`movie_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `genre`
--

LOCK TABLES `genre` WRITE;
/*!40000 ALTER TABLE `genre` DISABLE KEYS */;
INSERT INTO `genre` VALUES (700,'드라마'),(701,'드라마'),(701,'멜로/로맨스'),(702,'애니메이션'),(702,'코미디'),(702,'판타지'),(703,'드라마'),(704,'멜로/로맨스'),(704,'코미디'),(705,'드라마'),(706,'드라마'),(707,'드라마'),(707,'코미디'),(708,'드라마'),(709,'드라마'),(709,'액션'),(710,'드라마'),(710,'스릴러'),(711,'드라마'),(712,'드라마'),(712,'액션'),(713,'드라마'),(714,'애니메이션'),(715,'드라마'),(716,'다큐멘터리'),(717,'드라마'),(717,'액션'),(718,'드라마'),(718,'애니메이션'),(719,'애니메이션'),(720,'다큐멘터리'),(721,'드라마'),(722,'애니메이션'),(723,'드라마'),(724,'드라마'),(725,'다큐멘터리'),(726,'서부'),(726,'스릴러'),(726,'액션'),(727,'드라마'),(727,'미스터리'),(727,'스릴러'),(728,'모험'),(728,'코미디'),(729,'드라마'),(729,'미스터리'),(730,'드라마'),(730,'멜로/로맨스'),(731,'멜로/로맨스'),(732,'드라마'),(732,'코미디'),(733,'드라마'),(734,'다큐멘터리'),(735,'드라마'),(735,'코미디'),(736,'SF'),(736,'드라마'),(736,'스릴러'),(737,'애니메이션'),(738,'드라마'),(738,'액션'),(739,'멜로/로맨스'),(740,'범죄'),(740,'스릴러'),(741,'SF'),(741,'스릴러'),(742,'멜로/로맨스'),(742,'코미디'),(743,'범죄'),(743,'액션'),(744,'스릴러'),(744,'액션'),(745,'드라마'),(746,'스릴러'),(746,'액션'),(747,'공포'),(747,'스릴러'),(748,'드라마'),(748,'멜로/로맨스'),(749,'멜로/로맨스'),(749,'코미디'),(750,'드라마'),(750,'멜로/로맨스'),(751,'다큐멘터리'),(752,'드라마'),(752,'액션'),(753,'드라마'),(754,'드라마'),(755,'드라마'),(756,'SF'),(756,'스릴러'),(756,'액션'),(757,'SF'),(757,'모험'),(757,'액션'),(757,'판타지'),(758,'가족'),(758,'모험'),(758,'애니메이션'),(758,'코미디'),(759,'가족'),(759,'모험'),(759,'애니메이션'),(759,'액션'),(759,'코미디'),(760,'드라마'),(760,'모험'),(761,'가족'),(761,'애니메이션'),(761,'코미디'),(762,'SF'),(762,'모험'),(762,'액션'),(762,'판타지'),(763,'모험'),(763,'판타지'),(764,'액션'),(765,'액션'),(766,'모험'),(766,'액션'),(766,'판타지'),(767,'가족'),(767,'모험'),(767,'뮤지컬'),(767,'애니메이션'),(767,'코미디'),(767,'판타지'),(768,'SF'),(768,'모험'),(768,'액션'),(768,'판타지'),(769,'가족'),(769,'모험'),(769,'애니메이션'),(769,'액션'),(769,'코미디'),(770,'뮤지컬'),(770,'애니메이션'),(771,'모험'),(771,'액션'),(771,'판타지'),(772,'스릴러'),(772,'액션'),(773,'가족'),(773,'모험'),(773,'애니메이션'),(773,'코미디'),(774,'SF'),(774,'모험'),(774,'액션'),(775,'모험'),(775,'액션'),(775,'판타지'),(776,'모험'),(776,'액션'),(777,'애니메이션'),(777,'액션'),(777,'코미디'),(778,'SF'),(778,'모험'),(778,'스릴러'),(778,'액션'),(779,'가족'),(779,'모험'),(779,'뮤지컬'),(779,'애니메이션'),(779,'판타지'),(780,'범죄'),(780,'액션'),(781,'공포'),(782,'가족'),(782,'모험'),(782,'판타지'),(783,'드라마'),(783,'멜로/로맨스'),(783,'뮤지컬'),(784,'SF'),(784,'모험'),(785,'미스터리'),(785,'판타지'),(786,'SF'),(786,'모험'),(786,'액션'),(786,'코미디'),(786,'판타지'),(787,'드라마'),(788,'SF'),(788,'액션'),(788,'코미디'),(789,'미스터리'),(789,'스릴러'),(790,'SF'),(790,'모험'),(790,'액션'),(790,'판타지'),(791,'멜로/로맨스'),(791,'코미디'),(792,'멜로/로맨스'),(793,'범죄'),(793,'스릴러'),(793,'액션'),(794,'SF'),(794,'드라마'),(794,'스릴러'),(795,'가족'),(795,'모험'),(795,'코미디'),(796,'가족'),(796,'애니메이션'),(796,'코미디'),(797,'SF'),(797,'멜로/로맨스'),(797,'모험'),(797,'액션'),(798,'드라마'),(798,'모험'),(798,'액션'),(798,'판타지'),(799,'드라마'),(799,'멜로/로맨스'),(799,'전쟁'),(800,'서부'),(800,'액션'),(801,'드라마'),(801,'미스터리'),(801,'범죄'),(801,'스릴러'),(801,'액션'),(802,'드라마'),(802,'액션'),(803,'공포'),(803,'스릴러'),(804,'드라마'),(804,'스릴러'),(804,'액션'),(805,'모험'),(805,'판타지'),(806,'공포'),(807,'가족'),(807,'모험'),(807,'판타지'),(808,'범죄'),(808,'스릴러'),(808,'액션'),(809,'드라마'),(809,'액션'),(810,'드라마'),(810,'스릴러'),(811,'드라마'),(811,'멜로/로맨스'),(811,'서스펜스'),(812,'SF'),(812,'모험'),(812,'스릴러'),(813,'미스터리'),(813,'스릴러'),(814,'애니메이션'),(814,'판타지'),(815,'코미디'),(816,'드라마'),(816,'모험'),(817,'드라마'),(817,'범죄'),(817,'스릴러'),(818,'코미디'),(819,'스릴러'),(819,'액션'),(820,'모험'),(820,'스릴러'),(821,'공포'),(822,'드라마'),(823,'드라마'),(824,'가족'),(824,'모험'),(824,'애니메이션'),(824,'판타지'),(825,'드라마'),(825,'스릴러'),(825,'액션'),(826,'공포'),(826,'스릴러'),(827,'드라마'),(827,'코미디'),(828,'코미디'),(829,'코미디'),(830,'애니메이션'),(831,'드라마'),(832,'드라마'),(833,'드라마'),(834,'공포'),(834,'스릴러'),(835,'드라마'),(835,'멜로/로맨스'),(835,'코미디'),(836,'모험'),(836,'애니메이션'),(836,'코미디'),(837,'드라마'),(837,'미스터리'),(837,'범죄'),(837,'스릴러'),(837,'액션'),(838,'공포'),(839,'드라마'),(839,'스릴러'),(840,'범죄'),(840,'액션'),(840,'코미디'),(841,'드라마'),(841,'스릴러'),(842,'드라마'),(842,'코미디'),(843,'드라마'),(843,'범죄'),(844,'드라마'),(845,'범죄'),(845,'스릴러'),(846,'전쟁'),(846,'코미디'),(847,'드라마'),(848,'드라마'),(848,'범죄'),(849,'드라마'),(850,'범죄'),(850,'스릴러'),(851,'가족'),(851,'코미디'),(851,'판타지'),(852,'드라마'),(852,'스릴러'),(852,'전쟁'),(853,'스릴러'),(854,'가족'),(854,'모험'),(854,'애니메이션'),(854,'코미디'),(855,'멜로/로맨스'),(855,'액션'),(856,'드라마'),(856,'범죄'),(857,'액션'),(858,'SF'),(858,'모험'),(858,'액션'),(859,'드라마'),(859,'멜로/로맨스'),(860,'드라마'),(860,'멜로/로맨스'),(861,'드라마'),(862,'드라마'),(863,'드라마'),(864,'SF'),(864,'모험'),(864,'애니메이션'),(864,'액션'),(864,'코미디'),(865,'멜로/로맨스'),(865,'판타지'),(866,'멜로/로맨스'),(867,'드라마'),(868,'드라마'),(868,'액션'),(869,'드라마'),(869,'코미디'),(870,'다큐멘터리'),(871,'드라마'),(872,'코미디'),(873,'멜로/로맨스'),(874,'드라마'),(875,'공포'),(875,'드라마'),(875,'모험'),(875,'스릴러'),(875,'액션'),(876,'드라마'),(877,'SF'),(877,'드라마'),(878,'드라마'),(879,'드라마'),(879,'스릴러'),(880,'드라마'),(881,'스릴러'),(882,'다큐멘터리'),(883,'드라마'),(883,'전쟁'),(884,'드라마'),(884,'미스터리'),(884,'스릴러'),(885,'범죄'),(885,'액션'),(886,'드라마'),(887,'드라마'),(888,'드라마'),(888,'멜로/로맨스'),(889,'범죄'),(889,'액션'),(890,'액션'),(891,'드라마'),(892,'모험'),(892,'애니메이션'),(892,'판타지'),(893,'가족'),(893,'드라마'),(894,'드라마'),(895,'SF'),(895,'드라마'),(895,'스릴러'),(895,'액션'),(896,'드라마'),(897,'SF'),(897,'드라마'),(897,'모험'),(897,'애니메이션'),(897,'판타지'),(898,'드라마'),(899,'드라마'),(900,'다큐멘터리'),(901,'액션'),(901,'판타지'),(902,'드라마'),(903,'드라마'),(903,'스릴러'),(903,'액션'),(904,'범죄'),(904,'액션'),(905,'드라마'),(906,'드라마'),(907,'드라마'),(908,'드라마'),(908,'멜로/로맨스'),(909,'코미디'),(910,'드라마'),(911,'드라마'),(912,'다큐멘터리'),(913,'판타지'),(914,'다큐멘터리'),(915,'모험'),(915,'코미디'),(916,'다큐멘터리'),(917,'드라마'),(918,'드라마'),(918,'액션'),(919,'드라마'),(919,'코미디'),(920,'스릴러'),(921,'드라마'),(921,'판타지'),(922,'드라마'),(923,'드라마'),(924,'다큐멘터리'),(925,'드라마'),(925,'멜로/로맨스'),(926,'드라마'),(926,'코미디'),(927,'드라마'),(927,'전쟁'),(928,'멜로/로맨스'),(928,'액션'),(928,'코미디'),(929,'드라마'),(930,'드라마'),(930,'서사'),(931,'드라마'),(932,'드라마');
/*!40000 ALTER TABLE `genre` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2017-03-01 21:31:06
